# -*- coding: utf-8 -*-
"""Semi9-10.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1LWVXGeOeZH3KV1sb58xtJ02DW-Ke-nTj
"""



"""Задача №57. Решение в группах

1. Прочесть с помощью pandas файл
california_housing_test.csv, который находится в папке
sample_data
2. Посмотреть сколько в нем строк и столбцов
3. Определить какой тип данных имеют столбцы
"""

import pandas as pd

#1
df = pd.read_csv('sample_data/california_housing_train.csv')

#2
df.shape

#3
df.dtypes

"""Задача №59. Решение в группах

1. Проверить есть ли в файле пустые значения
2. Показать median_house_value где median_income < 2
3. Показать данные в первых 2 столбцах
4. Выбрать данные где housing_median_age < 20 и
median_house_value > 70000
"""

#1
df.isnull()

#2
df[df.median_income < 2]['median_house_value']

#3
df[df.columns[:2]]

#4
df[(df['housing_median_age'] < 20) & (df['median_house_value'] > 70000)]

"""Задача №61. Решение в группах
1. Определить какое максимальное и минимальное
значение median_house_value
2. Показать максимальное median_house_value, где
median_income = 3.1250
3. Узнать какая максимальная population в зоне
минимального значения median_house_value
"""

#1
print(df['median_house_value'].max(), df['median_house_value'].min())

#2
print(df[df['median_income']== 3.1250]['median_house_value'].max())

#3
print(df[df['median_house_value']==df['median_house_value'].min()]['population'].max())

"""Sem 10

1. Изобразите отношение households к population с помощью точечного графика

2. Визуализировать longitude по отношения к median_house_value, используя линейный график

3. Представить гистограмму по housing_median_age
4. Изобразить гистограмму по median_house_value с оттенком housing_median_age
"""

#1
import seaborn as sns
sns.scatterplot(data=df, x="households", y="population")

#2
sns.relplot(data=df, x="longitude", y="median_house_value", kind="line")

#3
sns.histplot(data=df, x="housing_median_age")

#4
sns.displot(df, x="median_house_value", hue="housing_median_age")